In [3]:
import pandas as pd
from pandas import Series, DataFrame

## Series

In [9]:
obj2 = pd.Series([1, 2, 3, 4], index=['d', 'b', 'a', 'c'])

In [10]:
obj2[obj2>2]

a    3
c    4
dtype: int64

In [11]:
'b' in obj2

True

In [12]:
'h' in obj2

False

In [13]:
obj2.name = 'values'

In [15]:
obj2.index.name = 'index'

## DataFrame

In [17]:
obj2

index
d    1
b    2
a    3
c    4
Name: values, dtype: int64

In [18]:
data = {'state':['Ohio', 'Nevada', 'California'],
        'year' :[2000, 2001, 2002],
        'pop'  :[1.5, 1.7, 2.0]}

In [20]:
df = pd.DataFrame(data)

## Swap the order of the columns in the dataframe

In [22]:
pd.DataFrame(df, columns=['pop', 'year', 'state'])

   pop  year       state
0  1.5  2000        Ohio
1  1.7  2001      Nevada
2  2.0  2002  California

## Add a new columns based on existing columns

In [24]:
df['eastern'] = df.state == 'Ohio'

In [25]:
df

        state  year  pop  eastern
0        Ohio  2000  1.5     True
1      Nevada  2001  1.7    False
2  California  2002  2.0    False

## Nested dict of dicts

In [26]:
pop = {'Nevada':{2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2002: 3.6}}

In [28]:
pop_df = pd.DataFrame(pop)

In [29]:
pop_df

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   NaN
2002     2.9   3.6

In [31]:
pop_df.index.name = 'Years'

In [32]:
pop_df

       Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [33]:
pop_df.values

array([[nan, 1.5],
       [2.4, nan],
       [2.9, 3.6]])

In [36]:
pop_df

       Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [37]:
2001 in pop_df.index

True